{
  "Classname": "BaseCharger",
  "Description": "Entity_Description_here",
  "KeyDescriptions": [
    {
      "keyName": "_minlight",
      "keyDescription": "Sets the minimum light level. Useful for when textures should always appear bright e.g. computer screens or holograms. Default is 0, max 1.",
      "keyChoices": []
    },
    {
      "keyName": "soundlist",
      "keyDescription": "Allows you to setup a sound replacement file func_healthcharge sounds. The path begins in 'svencoop/sound/mapname', whereas 'mapname' would be your map's name. You can go to the parent directory using '../'. A valid sound replacement file contains one or more lines with two sound-paths, which are separated by a space and wrapped into quotes. The first sound is the sound to be replaced. The second sound is the new sound. Sound-paths start in the sound directory. You cannot go to the parent directory using '../' in that case. These sounds do not need to be precached using a custom_precache point entity.",
      "keyChoices": []
    },
    {
      "keyName": "CustomJuice",
      "keyDescription": "Custom max charges amount. '0' for default.",
      "keyChoices": []
    },
    {
      "keyName": "CustomRechargeTime",
      "keyDescription": "Time, in seconds, for entity to replenish it's charges. '0' for default.",
      "keyChoices": []
    },
    {
      "keyName": "TriggerOnEmpty",
      "keyDescription": "Entity to fire when charges are fully consumed.",
      "keyChoices": []
    },
    {
      "keyName": "TriggerOnRecharged",
      "keyDescription": "Entity to fire when entity recharge itself after deplenishing and waiting \"Custom Recharge Time\".",
      "keyChoices": []
    },
    {
      "keyName": "CustomDeniedSound",
      "keyDescription": "Custom sound file override to play when charger holds no more charges, but player is still attempting to drain more.",
      "keyChoices": []
    },
    {
      "keyName": "CustomStartSound",
      "keyDescription": "Custom sound file override to play when player starts using this entity.",
      "keyChoices": []
    },
    {
      "keyName": "CustomLoopSound",
      "keyDescription": "Sound file to play (in a loop) when charging is in progress, just after \"Custom Start Sound\".",
      "keyChoices": []
    }
  ]
}